#include<iostream>
using namespace std;

/*
* 중앙부터 시작해서 육각형으로 1,2,3,4,... 로 돌아가서 한다.
* 중앙	- 1
* 1층	- 2,3,4,5,6,7 (6)
* 2층	- 8,9,10,11,12,13,14,15,16,17,18,19(12)
* 3층	- 20,21,22 .... , 37	(18)
* 4층	- 38 ~ 61 (24)
* 1, 1+5 , 1+5+6, 1+5+6+6
* 1		= 1,	1
* ~7	= 2,	1+6
* ~19	= 3,	1+6+12
* ~61	= 4,	1+6+12+18
* ->1+6(n*(n-1)/2) 의 범위 내에 있을때, 최소 이동거리 = n (n>0)
*/
int main()
{
	int x, n;
	cin >> n;
	x = 1;
	while (true)
	{
		if (1 + (6 * (x * (x - 1) / 2)) < n)
			x++;
		else
			break;
	}
	cout << x << endl;
}